Tekla Open API Reference for Tekla Structures 2025
Beam.BeamTypeEnum Enumeration
 The beam types. The strip and pad footings are valid only if the material type of the beam is concrete.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BeamTypeEnum
Public Enumeration BeamTypeEnum
Members
Member name | Value | Description
BEAM | 0 |  The beam.
PANEL | 1 |  The panel.
STRIP_FOOTING | 2 |  The concrete strip footing.
PAD_FOOTING | 3 |  The concrete pad footing.
COLUMN | 4 |  The column.
See Also
Reference
Tekla.Structures.Model Namespace